
&НаСервере
Процедура Реквизит1ПриИзмененииНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Реквизит1ПриИзменении(Элемент)
	Реквизит1ПриИзмененииНаСервере();
КонецПроцедуры

&НаСервереБезКонтекста
Процедура Реквизит2ОкончаниеВводаТекстаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Реквизит2ОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	Реквизит2ОкончаниеВводаТекстаНаСервере();
КонецПроцедуры
